[
  {
    "section_number": "21",
    "title": "",
    "content": "Subject to the other provisions contained in this Act and to such rules as the High Court may make in this behalf, all proceedings under this Act shall be regulated, as far as may be, by the Code of Civil Procedure, 1908."
  },
  {
    "section_number": "21A",
    "title": "Power to transfer petitions in certain cases",
    "content": "Where— (a) a petition under this Act has been presented to a district court having jurisdiction by a party to a marriage praying for a decree for judicial separation under section 10 or for a decree of divorce under section 13, and (b) another petition under this Act has been presented thereafter by the other party to the marriage praying for a decree for judicial separation or divorce on any ground, whether in the same district court or in a different district court, in the same State or in a different State, the petitions shall be dealt with together as per subsections (2) and (3)."
  },
  {
    "section_number": "21B",
    "title": "",
    "content": "The trial of a petition under this Act shall be continued from day to day until conclusion unless adjournment is necessary. Petitions should be tried within six months and appeals within three months from service of notice."
  },
  {
    "section_number": "21C",
    "title": "Documentary evidence",
    "content": "No document shall be inadmissible in evidence at the trial of a petition under this Act on the ground that it is not duly stamped or registered."
  },
  {
    "section_number": "22",
    "title": "Proceedings to be in camera and may not be printed or published",
    "content": "All proceedings under this Act shall be conducted in camera and publication is restricted unless permission is granted by the High Court or Supreme Court."
  },
  {
    "section_number": "23",
    "title": "Decree in proceedings",
    "content": "Court shall grant relief only if it finds the grounds valid, petitioner not taking advantage of own wrong, and no delay or collusion. Reconciliation efforts must be made where possible."
  },
  {
    "section_number": "23A",
    "title": "Relief for respondent in divorce and other proceedings",
    "content": "The respondent may counter-claim for relief on grounds like adultery, cruelty, or desertion by the petitioner."
  },
  {
    "section_number": "24",
    "title": "Maintenance pendente lite and expenses of proceedings",
    "content": "Court may order maintenance and litigation expenses if a spouse has insufficient income. To be resolved within 60 days of notice."
  },
  {
    "section_number": "25",
    "title": "Permanent alimony and maintenance",
    "content": "Court may grant lump sum or periodic maintenance considering income, conduct, and circumstances. Orders may be varied or rescinded under changed circumstances."
  },
  {
    "section_number": "26",
    "title": "Custody of children",
    "content": "Court may issue interim and final orders for custody, maintenance, and education of minor children, considering their wishes when possible."
  },
  {
    "section_number": "27",
    "title": "Disposal of property",
    "content": "Court may make provisions regarding jointly owned property presented at or about the time of marriage."
  },
  {
    "section_number": "28",
    "title": "Appeals from decrees and orders",
    "content": "All decrees and certain orders under this Act are appealable. Appeals must be filed within 90 days. No appeal on cost issues alone."
  },
  {
    "section_number": "28A",
    "title": "Enforcement of decrees and orders",
    "content": "Decrees and orders under this Act shall be enforced like civil court decrees."
  },
  {
    "section_number": "29",
    "title": "Savings",
    "content": "This Act does not invalidate otherwise valid marriages based on gotra, caste, or religion and does not affect customary rights or Special Marriage Act provisions."
  },
  {
    "section_number": "30",
    "title": "[Repealed]",
    "content": "Repealed by the Repealing and Amending Act, 1960."
  }
]